{
    "__comment": "Les catégories, loaders, le nombre de téléchargements, la date de mise à jour, l'image et la description (traduite) sont tous obtenu via https://modrinth.com/mods?s=downloads. ChatGPT a aussi été utilisé pour traduire certaines (la majorité des) descriptions.",
    "mods": [
        {
            "id": "fabricapi",
            "name": "Fabric API",
            "desc": "API légère et modulaire offrant plus de liberté pour les moddeurs de Fabric.",
            "category": ["lib"],
            "loader": ["fabric"],
            "img": "https://cdn.modrinth.com/data/P7dR8mSH/icon.png",
            "downloads": 30020000,
            "update": 1733433180,
            "version": ["16", "18", "20", "21"],
            "author": "modmuss50, sfPlayer1",
            "source": "https://modrinth.com/mod/fabric-api",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<h2>Fabric API</h2>",
                "<hr>",
                "<p>Crochets essentiels pour le modding avec Fabric</p>",
                "<p>Fabric API est la bibliothèque fournissant des crochets essentiels et des mécanismes d'interopérabilité pour les mods Fabric. Voici quelques exemples:</p>",
                "<ul><li>Exposition de fonctionnalités utiles mais difficiles d'accès pour de nombreux mods, telles que les particules, les biomes et les dimensions.</li>",
                "<li>Ajout d'événements, de crochets et d'API pour améliorer l'interopérabilité entre les mods.</li>",
                "<li>Fonctionnalités essentielles comme la synchronisation des registres et l'ajout d'informations aux rapports de crash.</li>",
                "<li>Une API de rendu avancée conçue pour être compatible avec les mods d'optimisation et les mods de refonte graphique.</li></ul>",
                "<p>Consultez également <a href=https://github.com/FabricMC/fabric-loader>Fabric Loader</a>, le chargeur de mods (principalement) indépendant de la version qui alimente Fabric. Fabric API est un mod comme tout autre mod Fabric qui nécessite l'installation de Fabric Loader.</p>",
                "<p>Pour obtenir du support et discuter avec d'autres développeurs ou utilisateurs, rendez-vous sur <a href=https://discord.gg/v6v4pMv>le serveur Discord de Fabric.</a></p>",
                "<h2>Utiliser Fabric API pour jouer avec des mods</h2>",
                "<hr>",
                "<p>Assurez-vous d'avoir installé Fabric Loader en premier. Vous pouvez trouver plus d'informations sur l'installation de Fabric Loader <a href=https://fabricmc.net/use/>ici</a>.</p>",
                "<p>Le fichier jar téléchargé doit être placé dans votre dossier mods.</p>"
            ]
        },
        {
            "id": "sodium",
            "name": "Sodium",
            "desc": "Sodium est un mod d'optimisation de graphique très puissant pour Minecraft 1.16+, qui améliore la performance et la qualité graphique.",
            "category": ["opt"],
            "loader": ["fabric", "neoforge", "quilt"],
            "img": "https://cdn.modrinth.com/data/AANobbMI/295862f4724dc3f78df3447ad6072b2dcd3ef0c9_96.webp",
            "downloads": 27520000,
            "update": 1733554740,
            "version": ["16", "18", "20", "21"],
            "author": "jellysquid3, IMS",
            "source": "https://modrinth.com/mod/sodium",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<p>Ce mod est le résultat de milliers d'heures de développement et a été rendu possible grâce à des joueurs comme vous. Si vous souhaitez montrer un signe d'appréciation pour mon travail et aider à soutenir le développement de Sodium, <a href=https://caffeinemc.net/donate>envisagez de m'offrir un café.</a></p>",
                "<hr>",
                "<img src=https://cdn.modrinth.com/data/AANobbMI/images/5ca2e8f6c72f3d543dd3dc95b706964c5678d80e.png alt=\"Comparaison de Sodium\" class=\"img-fluid\">",
                "<p>Sodium est un mod d’optimisation et un moteur de rendu avancé pour Minecraft, conçu pour améliorer considérablement les performances et la qualité graphique. Il offre une excellente compatibilité avec l’écosystème des mods, contrairement à d’autres mods axés sur le rendu, et ce, sans compromettre l’apparence du jeu, afin de conserver cette ambiance authentique de Minecraft.</p>",
                "<h2>📥 Guide d'installation</h2>",
                "<hr>",
                "<p>Sodium est disponible pour plusieurs chargeurs de mods, mais nous recommandons Fabric Loader pour une expérience simple et légère. Si vous utilisez un lanceur tiers, il dispose probablement d’une fonctionnalité intégrée pour installer automatiquement les chargeurs de mods. Une fois votre chargeur de mods installé, placez simplement Sodium dans votre dossier mods, comme tout autre mod.<br><span class=\"fw-bold\">Vous n’êtes pas sûr d’avoir correctement installé le mod ?</span>Vérifiez l’écran des paramètres vidéo dans Minecraft. Il devrait afficher notre interface utilisateur améliorée pour configurer les paramètres.<br><span class=\"fw-bold\">Vous ne savez pas comment configurer le mod ?</span>Pas d’inquiétude, vous n’en avez probablement pas besoin. Par défaut, Sodium active toutes les optimisations compatibles avec votre système pour vous offrir la meilleure expérience possible. Vous devriez uniquement modifier les paramètres vidéo liés aux performances ou à d’autres fonctionnalités avancées si vous rencontrez des problèmes.<br><span class=\"fw-bold\">Besoin de performances supplémentaires ?</span>Sodium optimise uniquement le code de rendu de Minecraft. Vous pouvez également installer nos autres mods, comme Lithium (pour MC 1.15+) et Phosphor (pour MC <1.19), pour optimiser d’autres parties du jeu. Cela permet aux joueurs de choisir les mods qu’ils souhaitent utiliser, mais nous recommandons généralement d’utiliser notre collection complète.</p>",
                "<h2>✅ Compatibilité matérielle</h2>",
                "<hr>",
                "<p>Nous fournissons un support officiel uniquement pour les cartes graphiques avec des pilotes à jour compatibles avec OpenGL 4.5 ou plus récent. La plupart des cartes graphiques sorties au cours des 12 dernières années répondent à ces exigences, notamment :</p>",
                "<ul><li>INTEL : HD Graphics 500 Series (Skylake) ou plus récent</li>",
                "<li>NVIDIA : GeForce 400 Series (Fermi) ou plus récent</li>",
                "<li>AMD : Radeon HD 7000 Series (GCN 1) ou plus récent</li></ul>",
                "<p><span class=\"fw-bold\">Presque toutes les cartes graphiques déjà compatibles avec Minecraft (qui nécessite OpenGL 3.3) devraient également fonctionner avec Sodium.</span> Cependant, notre équipe ne peut pas garantir la compatibilité ou fournir un support pour les anciennes cartes graphiques, qui pourraient ne pas fonctionner avec les futures versions de Sodium.<br><span class=\"fw-bold\">Rencontrez-vous des problèmes ?</span>Assurez-vous que vos pilotes graphiques sont à jour. Les pilotes obsolètes sont souvent la cause de crashs, de bugs d’affichage et de problèmes de performance.<br>Les appareils Android (et certains appareils Windows sur ARM) utilisant des couches de traduction OpenGL (comme GL4ES, ANGLE, GLonD3D12, etc.) ne sont pas pris en charge et ne fonctionneront probablement pas avec Sodium. Ces couches ne mettent pas en œuvre les fonctionnalités nécessaires et présentent des bogues sous-jacents que nous ne pouvons pas contourner.",
                "<h2>🐛 Comment signaler des problèmes</h2>",
                "<hr>",
                "<p>Utilisez le suivi des problèmes (<a href=https://github.com/CaffeineMC/sodium/issues>issue tracker</a>) lié en haut de la page pour signaler les bugs, crashs et autres problèmes. Assurez-vous d’inclure des informations sur les mods que vous utilisez et d’attacher les fichiers de crash/journal si disponibles.</p>",
                "<h2>❓ Foire aux questions</h2>",
                "<hr>",
                "<p>Nous avons une courte documentation avec les questions les plus fréquemment posées <a href=https://github.com/CaffeineMC/caffeine-meta/wiki/FAQ>ici</a>. Votre question a probablement déjà une réponse.</p>",
                "<h2>⚙️ Détails techniques</h2>",
                "<hr>",
                "<p>Comment Sodium fonctionne-t-il exactement ? Nous ne pouvons évidemment pas prétendre que le jeu est « magiquement » plus rapide sans explications. Voici une liste non exhaustive des améliorations significatives apportées par Sodium :</p>",
                "<ul><li>Rendu du monde réécrit : Nous remplaçons tout le code de rendu du monde de Minecraft par notre propre implémentation, basée sur des techniques modernes. Cela inclut le batching de géométrie et la consolidation des passes de dessin pour réduire la charge du CPU. Sodium est plus qu’un simple mod d’optimisation : c’est un véritable moteur de rendu.</li>",
                "<li>Format compact pour la géométrie : Réduction d’environ 40 % de la mémoire vidéo utilisée par les chunks. De plus, un deuxième passage de culling élimine les géométries non visibles pour réduire la charge sur le GPU.</li>",
                "<li>Système de génération de géométrie réécrit : Inclut la colorisation des biomes, l’éclairage et le shading, accélérant ainsi le chargement des chunks.</li>",
                "<li>Optimisation des threads : Améliore l’utilisation des processeurs multicœurs pour réduire les pics de latence lors de la modification des blocs.</li>",
                "<li>Optimisation des textures animées : Les textures non visibles ne sont pas mises à jour, ce qui accélère le rendu.</li></ul>",
                "<p>Contrairement à d'autres mods, Sodium améliore également la qualité graphique. Par exemple :</p>",
                "<ul><li>Les couleurs des biomes sont lissées entre les faces des blocs.</li>",
                "<li>L’éclairage fluide fonctionne correctement sur les fluides et les blocs spéciaux.</li></ul>"
            ]
        },
        {
            "id": "iris",
            "name": "Iris",
            "desc": "Iris Shaders est un mod qui permet d'ajouter des Shaders créé par la communauté, rendant le jeu encore plus majestueux.",
            "category": ["opt"],
            "loader": ["fabric", "neoforge", "quilt"],
            "img": "https://cdn.modrinth.com/data/YL57xq9U/18d0e7f076d3d6ed5bedd472b853909aac5da202_96.webp",
            "downloads": 21550000,
            "update": 1733966880,
            "version": ["16", "18", "20", "21"],
            "author": "coderbot, IMS",
            "source": "https://modrinth.com/mod/iris",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<h2>Liens</h2>",
                "<hr>",
                "<ul>",
                "<li>Visitez <a href=https://irisshaders.dev/>notre site web</a> pour des téléchargements et de belles captures d'écran !</li>",
                "<li>Visitez <a href=https://modrinth.com/shaders>la section shaders</a> pour trouver des packs de shaders !</li>",
                "<li>Rejoignez <a href=https://discord.gg/jQJnav2jPu>notre serveur Discord</a> pour discuter du mod et obtenir du support ! C'est également un excellent endroit pour obtenir des mises à jour sur le développement en temps réel.</li>",
                "<li>Consultez <a href=https://github.com/IrisShaders/Iris/tree/1.21/docs/development>la documentation pour développeurs</a> pour des informations sur le développement, la compilation et la contribution à Iris !</li>",
                "</ul>",
                "<h2>Installation</h2>",
                "<hr>",
                "<p>Vous pouvez trouver un guide d'installation <a href=https://github.com/IrisShaders/Iris/blob/multiloader-new/docs/guide.md>ici</a>.</p>",
                "<h2>FAQ</h2>",
                "<hr>",
                "<p>Trouvez des réponses aux questions fréquemment posées sur notre <a href=https://github.com/IrisShaders/Iris/blob/multiloader-new/docs/faq.md>page FAQ</a>.</p>",
                "<p>Iris prend en charge presque tous les packs de shaders, mais une liste des packs non pris en charge est disponible <a href=https://github.com/IrisShaders/Iris/blob/1.21/docs/unsupportedshaders.md>ici</a>.</p>",
                "<p>Une liste des limitations irréparables d'Iris est disponible <a href=https://github.com/IrisShaders/Iris/blob/1.21/docs/usage/limitations.md>ici</a>.</p>",
                "<h2>Plus d'informations</h2>",
                "<hr>",
                "<p>Vous trouverez plus d'informations sur notre <a href=https://github.com/IrisShaders/Iris/blob/1.21/README.md>README</a>.</p>"
            ]
        },
        {
            "id": "clothconfigapi",
            "name": "Cloth Config API",
            "desc": "Librairie de configuration pour des mods Minecraft.",
            "category": ["lib"],
            "loader": ["fabric", "neoforge", "forge"],
            "img": "https://cdn.modrinth.com/data/9s6osm5g/ed8a2316cbb6f4fc5f510e8e13a59a85cbbbff4d_96.webp",
            "downloads": 21450000,
            "update": 1733505180,
            "version": ["16", "18", "20", "21"],
            "author": "shedaniel",
            "source": "https://modrinth.com/mod/cloth-config",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<p>Cloth Config API est une API pour les écrans de configuration.</p>",
                "<p>Wiki pour les développeurs</p>",
                "<a href=https://shedaniel.gitbook.io/cloth-config/>https://shedaniel.gitbook.io/cloth-config/</a>",
                "<img src=https://i.imgur.com/AkpzyeC.png alt=\"Image d'exemple de Cloth Config API\" class=\"img-fluid\">"
            ]
        },
        {
            "id": "modmenu",
            "name": "Mod Menu",
            "desc": "Mod Menu permet d'afficher tous les mods qui sont installés sur Minecraft directement à partir du menu principal.",
            "category": ["lib"],
            "loader": ["fabric", "quilt"],
            "img": "https://cdn.modrinth.com/data/mOgUt4GM/1b6bcdef5a3d92572f517122650716be7ec6458b.webp",
            "downloads": 17590000,
            "update": 1733269740,
            "version": ["16", "18", "20", "21"],
            "author": "Terraformers, Prospector, modmuss50",
            "source": "https://modrinth.com/mod/modmenu",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<h2>Mod Menu</h2>",
                "<hr>",
                "<img src=https://cdn.modrinth.com/data/mOgUt4GM/images/155dd2b006883b168b1279ec0ff21e753946518b.png alt=\"Ce que le menu ressemble - Mod Menu\" class=\"img-fluid\">",
                "<p>Mod Menu vous permet de voir les mods que vous avez installés et, si le mod le permet, d'accéder rapidement et facilement aux écrans de configuration du mod.</p>",
                "<p>Mod Menu prend également en charge des fonctionnalités plus avancées, telles que des noms et descriptions de mods traduisibles, la prise en charge de la <a href=https://placeholders.pb4.eu/user/quicktext/>mise en forme QuickText</a> dans les descriptions de mods grâce à l'<a href=https://modrinth.com/mod/placeholder-api>API de substituts de texte</a> de <a href=https://ko-fi.com/patbox>Patbox</a>, l'exclusion des mods de bibliothèque des mods réguliers, un vérificateur de mise à jour pour les mods hébergés sur Modrinth ou qui fournissent leurs propres sources de mise à jour, ainsi qu'une configuration approfondie pour toutes les fonctionnalités que nous offrons.</p>",
                "<h5>Plateformes supportées</h5>",
                "<p>Mod Menu est actuellement disponible pour Fabric ou Quilt sur Minecraft : Java Edition 1.14 ou version ultérieure.</p>"
            ]
        },
        {
            "id": "xaeros-minimap",
            "name": "Xaero's Minimap",
            "desc": "Une petite carte pour vous aider à vous repérer dans votre monde.",
            "category": ["adv"],
            "loader": ["fabric", "neoforge", "forge", "quilt"],
            "img": "https://cdn.modrinth.com/data/1bokaNcj/354080f65407e49f486fcf9c4580e82c45ae63b8_96.webp",
            "downloads": 11310000,
            "update": 1733478600,
            "version": ["16", "18", "20", "21"],
            "author": "thexaero",
            "source": "https://modrinth.com/mod/xaeros-minimap",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<h2>Xaero's Minimap</h2>",
                "<hr>",
                "<img src=https://wsrv.nl/?url=https%3A%2F%2Fchocolateminecraft.com%2Fimages%2Fminimap_2020.png&n=-1 alt=\"Exemple de map\" class=\"img-fluid\"><br>",
                "<p>Contrairement à de nombreux autres mods de minimap, Xaero's minimap conserve l'esthétique du Minecraft vanilla, ce qui permet une intégration plus fluide dans le jeu. C'est également la première minimap carrée rotative pour Minecraft. Parmi les nombreuses options de personnalisation, il existe une option pour une minimap de forme circulaire et un paramètre distinct pour verrouiller la rotation de la minimap (en utilisant une flèche directionnelle à la place). La minimap peut afficher les entités environnantes, y compris les joueurs, les mobs et les objets, sous forme de points avec une couleur personnalisée ou sous forme d'icônes (généralement des têtes). En plus des directions par défaut de la boussole, vous pouvez placer vos propres waypoints qui sont visibles à la fois sur la minimap et dans le monde du jeu. Les waypoints vous aident à trouver des endroits précédemment visités ou à atteindre des coordonnées spécifiques, avec téléportation optionnelle. La minimap peut afficher les blocs environnants au-dessus et en dessous du sol (mode cave). Ce ne sont que quelques-unes des fonctionnalités du mod, il y en a beaucoup d'autres. Veuillez lire la section « Fonctionnalités de la minimap » ci-dessous pour une liste complète. Pour respecter les règles des serveurs multijoueurs, il existe 2 éditions du mod : complète et fair-play, cette dernière étant conçue pour le PVP équitable. Ce mod est principalement côté client. L'installer côté serveur est optionnel pour des fonctionnalités supplémentaires comme l'identification des mondes.</p>",
                "<p>Suivez-moi sur Mastodon (alternative à Twitter) ? <a href=\"https://mas.to/@xaero96\">mas.to/@xaero96</a></p>",
                "<p>Supportez-moi sur Patreon ? <a href=\"https://patreon.com/xaero96\">patreon.com/xaero96</a></p>",
                "<p>Merci !</p>",
                "<h2>Fonctionnalités</h2>",
                "<hr>",
                "<ul>",
                "<li>Apparence de Minecraft vanille.</li>",
                "<li>Options de taille de minimap multiples, y compris automatique.</li>",
                "<li>Options de zoom multiples.</li>",
                "<li>Deux options de forme de minimap : carrée ou circulaire.</li>",
                "<li>Fonctionne plus fluidement que de nombreux autres mods de minimap.</li>",
                "<li>Peut être placé n'importe où sur l'écran à l'aide du paramètre « Changer la position »/écran. Vous pouvez même le déplacer par 1 pixel si vous le souhaitez. Cela peut être utile lors de l'utilisation d'autres mods UI.</li>",
                "<li>2 modes de couleur de bloc : Vanille, qui utilise les couleurs des cartes Minecraft vanille, et Précis, qui utilise les couleurs des textures de blocs et des biomes. Vous pouvez également activer les couleurs des biomes pour le mode Vanille à l'aide d'un paramètre séparé.</li>",
                "<li>Une liaison de touche personnalisée (Z par défaut) pour agrandir temporairement la minimap afin de mieux regarder autour de vous. Toutes les liaisons de touches se trouvent dans le menu des contrôles vanille. Il existe également des paramètres pour contrôler le comportement de la minimap lorsqu'elle est agrandie, par exemple pour centrer la minimap à l'écran ou pour zoomer complètement.</li>",
                "<li>Personnalisation de l'ombrage de la carte avec les paramètres « Profondeur du terrain » et « Pentes du terrain ».</li>",
                "<li>Compatible avec <a href=\"https://modrinth.com/mod/xaeros-world-map\">Xaero's World Map</a>. Par défaut, utilise les textures de carte générées par le mod de carte du monde au lieu de générer les siennes. Cela améliore les performances lorsqu'on utilise les deux mods.</li>",
                "<li>Option pour limiter l'accès à la minimap en la liant à un objet requis dans votre barre d'outils ou à équiper. Par exemple, ajoutez minimapItemId:minecraft:compass dans le fichier de configuration pour la lier à l'objet boussole. Ainsi, la minimap ne sera pas affichée à moins que vous n'ayez la boussole dans votre barre d'outils ou équipée.</li>",
                "<li>Effets de potion pour contrôler l'utilisation de la minimap ou certaines de ses fonctionnalités pour les joueurs de votre serveur/carte. Les effets de potion suivants existent à l'heure actuelle : xaerominimap:no_minimap, xaerominimap:no_entity_radar, xaerominimap:no_waypoints, xaerominimap:no_cave_maps. Les effets sont de type neutre par défaut, mais vous pouvez aussi spécifier un type nuisible en ajoutant _harmful à la fin de l'ID de l'effet, par exemple xaerominimap:no_entity_radar_harmful.</li>",
                "<li>Traduit en plusieurs langues.</li>",
                "<li>Option pour verrouiller le nord afin d'empêcher la minimap de tourner et afficher à la place la direction de votre personnage avec une flèche.</li>",
                "<li>Fonctionne à la fois au-dessus et sous terre grâce au mode automatique Cave. Le mode Cave s'active également dans les bâtiments. Vous pouvez choisir la taille du « toit solide » au-dessus de vous que le mod recherche pour activer le mode Cave. Un toit de taille 3x3 et plus devrait empêcher l'activation du mode Cave lorsque vous êtes sous des blocs de bûches pendant que vous coupez du bois.</li>",
                "<li>Waypoints. Pratiquement un nombre infini. Peut être téléporté (permis pour la commande de téléportation dans le chat nécessaire). Les waypoints sont rendus dans le monde du jeu et affichés sur la minimap. Vous pouvez masquer tous ou certains waypoints. Appuyez sur B pour créer un nouveau waypoint. Appuyez sur U pour lister tous les waypoints. Dans la liste des waypoints, vous pouvez ajouter/modifier un ou plusieurs waypoints, les trier, afficher les waypoints des autres sous-mondes/dimensions et bien plus encore.</li>",
                "<li>Waypoints locaux et mondiaux. Pour vider l'écran des waypoints inutiles, vous pouvez créer des waypoints locaux qui, contrairement aux mondiaux, sont affectés par l'option « Distance de dessin maximale des WP ». Cela vous permet de définir un seul waypoint mondial pour une grande zone/région et plusieurs locaux dans la zone/région. Seuls les waypoints mondiaux seront visibles lorsque vous êtes au-delà de la distance maximale de dessin.</li>",
                "<li>Ensembles de waypoints. Vous pouvez organiser vos waypoints en les triant dans des ensembles. L'ensemble actuel peut être changé rapidement avec une liaison de touche. Toutes les liaisons de touches se trouvent dans le menu des contrôles vanille.</li>",
                "<li>Partage de waypoints. Vous pouvez partager vos waypoints dans le chat du jeu avec les joueurs sur le serveur. Cela se fait depuis la liste des waypoints (appuyez sur U).</li>",
                "<li>Deathpoints. Un waypoint automatique en forme de crâne est créé à chaque mort. Les anciens deathpoints sont convertis en waypoints réguliers, que vous pouvez désactiver à l'aide du paramètre « Garder les anciens deathpoints ».</li>",
                "<li>Affiche les réclamations de chunks et les joueurs alliés du mod <a href=\"https://modrinth.com/mod/open-parties-and-claims\">Open Parties and Claims</a>.</li>",
                "<li>Grille de chunk activable. La grille de chunk vous montre où commencent et finissent les chunks de blocs.</li>",
                "<li>Mode chunks de slimes activable. Les chunks où des slimes peuvent apparaître sont marqués avec un superposé vert.</li>",
                "<li>Superposition de lumière personnalisée. Vous pouvez configurer une superposition de lumière qui marquera les blocs avec une couleur personnalisée s'ils sont dans une plage de valeurs de lumière personnalisée, qui est la lumière du bloc de 0 à 7 par défaut. Les paramètres par défaut sont destinés à trouver des blocs où des mobs peuvent apparaître. Vous pouvez l'utiliser à n'importe quelle fin.</li>",
                "<li>Détection de plusieurs mondes en multijoueur. Si vous installez le mod minimap côté serveur en plus du côté client, chaque monde de serveur devrait avoir un « sous-monde » de waypoints distinct. Sinon, une séparation de monde beaucoup moins fiable est utilisée, basée sur le point de spawn du monde.</li>",
                "<li>Affiche les mobs sur la carte sous forme de points jaunes. Les mobs hostiles et amicaux peuvent être colorés différemment. Ils peuvent également être affichés sous forme d'icônes/têtes.</li>",
                "<li>Affiche les joueurs sur la carte sous forme de points blancs ou de têtes de joueur. Ils peuvent également être affichés sous forme d'icônes/têtes.</li>",
                "<li>Affiche les objets sur la carte sous forme de points rouges.</li>",
                "<li>Affiche toutes les autres entités comme les flèches et les cadres d'objets sous forme de points colorés.</li>",
                "<li>Peut afficher la minimap dans la barre d'inventaire de manière circulaire ou rectangulaire.</li>",
                "<li>Possibilité de masquer certaines entités.</li>",
                "<li>Affiche les icônes des structures comme les villages et les donjons sur la minimap.</li>",
                "<li>Affiche la ligne de vue de la minimap et les zones découvertes avec un superposé.</li>",
                "<li>Compatibilité avec les mods de type world generation.</li>",
                "</ul>",
                "<h2>FAQ</h2>",
                "<hr>",
                "<h5>Pourquoi la téléportation vers un waypoint ne fonctionne-t-elle pas pour moi ?</h5>",
                "<p>Il peut y avoir plusieurs raisons à cela. Le mod envoie une commande de chat pour vous téléporter vers les waypoints, qui est par défaut /tp @s x y z, donc des autorisations appropriées sont nécessaires. La commande /tp de base nécessite le statut OP (triches activées), mais il est possible d'avoir des permissions séparées pour les commandes sur un serveur non-vanille avec certains plugins installés. La commande utilisée peut être modifiée dans les paramètres de la minimap avec l'option « Commande de téléportation par défaut » ou par serveur dans le menu des waypoints avec l'option « Commande de téléportation via chat ». Les commandes de téléportation non-vanille ne supportent souvent pas les sélecteurs comme @s, vous devrez donc peut-être les supprimer de la commande configurée. La téléportation par clic droit sur la carte du monde utilise un paramètre de commande propre. Vous pouvez en savoir plus à ce sujet sur la page de description de la carte du monde sous FAQ.</p>",
                "<p>Si le bouton « Téléportation » est désactivé, cela peut également signifier plusieurs choses. La raison la plus courante est l'utilisation manuelle de waypoints depuis un sous-monde qui n'est pas celui « auto » mais toujours dans la même dimension. Si le sous-monde « auto » n'est pas celui qui doit être sélectionné automatiquement sur un monde donné, sélectionnez le sous-monde correct et utilisez « Rendre le sous-monde auto » dans les options du menu des waypoints. Cela échangera toutes les données de waypoints entre les 2 sous-mondes et vous pourrez vous téléporter vers les waypoints, qui se trouvent maintenant dans votre sous-monde « auto ».</p>",
                "<p>Si le sous-monde « auto » EST sélectionné mais que le bouton de téléportation est toujours désactivé, cela signifie probablement que la téléportation a été désactivée manuellement pour le serveur/le monde. Vérifiez l'option de téléportation dans les options du menu des waypoints. Si elle est désactivée, vous ne pouvez l'activer que via le fichier de configuration spécifique au serveur dans le répertoire du jeu -> xaero/minimap (XaeroWaypoints dans les versions plus anciennes). Je recommande de quitter Minecraft avant de modifier des fichiers de configuration. Et faites des copies de sauvegarde de temps en temps.</p>",
                "<h5>Pourquoi mes waypoints ne sont-ils plus affichés pour un serveur spécifique ?</h5>",
                "<p>Ne paniquez pas. Ils ne sont presque certainement pas réellement supprimés. Si vous utilisez le mod de carte du monde et qu'il a également été réinitialisé, commencez par le restaurer avant de vous occuper des waypoints. Lisez la section « Pourquoi ma carte du monde a-t-elle été réinitialisée pour un serveur spécifique ? » sur la page de description de la carte du monde. Une fois cela fait, continuez à lire.</p>",
                "<p>Commencez par ouvrir le menu complet des waypoints. Appuyez sur U dans le jeu pour cela. Vérifiez dans le menu des contrôles de base si la touche U ne fonctionne pas. Passez en revue les sous-mondes listés dans le menu déroulant en haut à droite. Tous les sous-mondes de waypoints pour l'adresse du serveur actuel doivent y être. Si aucun d'eux n'a les bons waypoints pour le monde/la dimension dans laquelle vous vous trouvez, l'adresse du serveur a probablement été modifiée. Trouvez l'ancienne adresse du serveur dans le menu déroulant en haut à gauche, sélectionnez-la et allez dans Options -> Rendre le monde/serveur auto. Vous devriez maintenant pouvoir trouver le sous-monde correct dans le menu déroulant en haut à droite. Si le bon sous-monde est déjà marqué comme (auto), cela signifie que le sous-monde est sélectionné automatiquement pour votre monde/dimension actuel, et vous devriez être prêt à partir. Si le mauvais sous-monde est marqué comme (auto), continuez à lire.</p>",
                "<h5>Utilisez-vous le mod de carte du monde ?</h5>",
                "<p>Une des raisons les plus courantes pour laquelle le mauvais sous-monde est sélectionné automatiquement est l'utilisation incorrecte du mod de carte du monde en mode multijoueur (depuis la version 1.6). Assurez-vous de sélectionner la carte correcte pour votre monde actuel avant de la valider. Cela affecte quels waypoints sont affichés pour vous. Le menu de sélection de la carte se trouve sur l'écran de la carte du monde, si vous cliquez sur l'icône en bas à gauche (sauf si elle est ouverte par défaut). Envisagez de changer le mode de sélection de la carte pour l'un des modes automatiques, si cela correspond au serveur sur lequel vous jouez.</p>",
                "<p>Votre carte actuellement confirmée affecte quel sous-monde de waypoints dans le mod minimap est considéré comme automatique (auto). Cela permet à chaque carte créée d'avoir des données de waypoints distinctes. À tout moment, vous pouvez sélectionner et afficher n'importe quel sous-monde de waypoints non automatique en allant dans le menu des waypoints (appuyez sur U) et en le sélectionnant dans le menu déroulant en haut à droite. Vous pouvez rendre n'importe quel sous-monde automatique pour votre carte actuellement confirmée en sélectionnant Options -> Rendre le sous-monde auto.</p>",
                "<h5>Vous n'utilisez pas le mod de carte du monde ?</h5>",
                "<p>Le mauvais sous-monde étant considéré comme (auto) et donc sélectionné automatiquement peut être causé par un plugin serveur modifiant le comportement de l'objet boussole de base et interférant avec la détection « multi-monde » du mod, si vous l'avez activée (désactivée par défaut). Dans la plupart de ces cas, l'objet boussole pointe vers votre lit au lieu du point de spawn global. Dormir dans le bon lit devrait tout rétablir pour vous si dormir dans un autre lit était la cause de la disparition des waypoints.</p>",
                "<p>Si cela s'est produit à cause de l'ajout d'un nouveau plugin (et si le supprimer n'est pas une option pour vous), voici comment vous pouvez restaurer vos waypoints :</p>",
                "<ol>",
                "<li>Trouvez le bon « sous-monde » de waypoints dans le menu déroulant en haut à droite dans l'écran des waypoints, c'est celui qui contient les waypoints dont vous avez besoin dans votre dimension actuelle. Commencez peut-être par l'overworld ?</li>",
                "<li>Utilisez Options -> Rendre le sous-monde auto.</li>",
                "<li>Faites de même pour chaque dimension (entrez dans les dimensions avant de le faire !).</li>",
                "<li>Si c'est un serveur simple avec 1 monde (pas de mondes de hub/lobby, pas de mondes de mini-jeux, pas de mondes de plots créatifs, etc.), désactivez également la « Détection de multi-monde » dans le même menu Options. Vous pourrez la réactiver plus tard si jamais vous en avez besoin.</li>",
                "</ol>",
                "<p>Contactez-moi si vous avez des questions !</p>",
                "<h5>Comment ajouter mes propres icônes d'entité ou remplacer celles par défaut ?</h5>",
                "<p>Tout d'abord, assurez-vous que vous avez bien activé l'affichage des icônes/entités dans les paramètres de la minimap -> Catégories de radar d'entités, que vous l'ayez défini sur « Toujours » ou « Liste des joueurs ». Assurez-vous simplement que vous savez comment les afficher. Ce sont les icônes dont parle cette section.</p>",
                "<p>Depuis la version 21.6.0 du mod minimap, vous pouvez remplacer les icônes par défaut affichées pour les entités par vos propres sprites/images en créant un pack de ressources (ou en incluant les ressources nécessaires dans votre propre mod). De plus, vous pouvez ajouter ou améliorer la prise en charge des variantes de type d'entité (différentes variantes du même type d'entité ayant des icônes différentes) en créant un simple mod vous-même ou en incluant du code dans votre mod existant. Bien que cela soit généralement inutile pour les types d'entités à variantes simples (la plupart des types d'entités).</p>",
                "<p>Par défaut, le mod minimap rend toutes les icônes d'entité à l'aide des modèles de rendu des entités liés aux entités. Cela prend en charge toutes les mobs vanilles et certaines mobs bipèdes/quadrupèdes simples dont les modèles ont des parties facilement identifiables (tête, oreilles, nez, etc.). Si le mod ne parvient pas à le faire, le point coloré est affiché à la place.</p>",
                "<p>Le répertoire des fichiers pertinents pour remplacer les icônes est /assets/xaerominimap/entity/icon/. Vous pouvez le trouver dans le fichier .jar du mod minimap et extraire les fichiers/dossiers contenus pour votre référence. Le fichier .jar contient un fichier exemple pour remplacer les icônes d'un type d'entité de mod /assets/xaerominimap/entity/icon/definition/example_mod/example_entity.json. Le fichier exemple correspondrait au type d'entité example_mod:example_entity, si cela existait. Veuillez lire les commentaires dans le fichier example_entity.json pour en apprendre davantage sur sa structure, afin de pouvoir créer vos propres définitions d'icônes similaires à celle-ci.</p>",
                "<p>De plus, /assets/xaerominimap/entity/icon/definition/minecraft/ contient plusieurs fichiers exemples pour les types d'entités vanilles qui peuvent nécessiter des commentaires supplémentaires concernant la prise en charge des variantes de types d'entités par défaut. Par défaut, les entités ont un support de variantes très simple où l'ID de variante du type d'entité est simplement l'emplacement de la ressource principale de la texture de l'entité.</p>",
                "<p>Si vous définissez l'option « debugEntityVariantIds » dans le fichier de configuration de la minimap sur true, alors les IDs de variante des entités nouvellement rencontrées (variantes) seront imprimés dans le chat et le journal/la console.</p>",
                "<p>Depuis la version 21.8.0 du mod minimap, vous pouvez également configurer votre propre rendu basé sur des modèles. Veuillez lire les commentaires dans le fichier exemple /assets/xaerominimap/entity/icon/definition/example_mod/example_entity.json pour toutes les informations nécessaires.</p>",
                "<p>Consultez ce projet génial par <a href='https://www.curseforge.com/members/babybluetit'>babybluetit</a>, si vous voulez voir une implémentation réelle d'icônes personnalisées ou l'utiliser : <a href='https://www.curseforge.com/minecraft/texture-packs/xaeros-minimap-modded-support'>https://www.curseforge.com/minecraft/texture-packs/xaeros-minimap-modded-support</a></p>",
                "<h5>Comment interdire l'utilisation du mode cave et/ou du radar d'entités sur mon serveur ?</h5>",
                "<p>Pour ce faire, veuillez installer le mod côté serveur (nécessite un serveur Forge/Fabric/Quilt au moment de la rédaction). Lorsque vous démarrez votre serveur, un nouveau fichier de configuration « commun » sera créé directement dans le répertoire du serveur (pas dans le dossier du monde). Dans ce fichier de configuration, vous avez plusieurs options qui vous permettent de désactiver certaines fonctionnalités du mod pour vos joueurs. Les modifications nécessitent un redémarrage du serveur.</p>",
                "<p>Alternativement, vous pouvez inclure les chaînes suivantes dans un message serveur/système envoyé aux joueurs (lors de la connexion), ce qui fera ce qui suit :</p>",
                "<ul>",
                "<li>§f§a§i§r§x§a§e§r§o - désactive le mode cave de la minimap (y compris la carte du monde) et le radar d'entités (mode fair-play)</li>",
                "<li>§x§a§e§r§o§w§m§n§e§t§h§e§r§i§s§f§a§i§r - permet au mode cave de la carte du monde de fonctionner dans le Nether malgré la minimap en mode fair-play</li>",
                "<li>§n§o§m§i§n§i§m§a§p - désactive complètement la minimap</li>",
                "<li>§r§e§s§e§t§x§a§e§r§o - réinitialise tous les drapeaux de message système</li>",
                "</ul>",
                "<h5>Comment permettre aux joueurs utilisant un client vanilla de rejoindre mon serveur qui a le mod installé ?</h5>",
                "<p>Cherchez un fichier de configuration « commun » directement dans votre répertoire serveur (pas dans le dossier du monde). Dans ce fichier de configuration, vous avez plusieurs options qui vous permettent de désactiver certaines fonctionnalités du mod pour vos joueurs. Une des options vous permet de désactiver l'enregistrement des effets de statut, ce qui empêche les joueurs de rejoindre. Les modifications nécessitent un redémarrage du serveur.</p>"
            ]
        },
        {
            "id": "jei",
            "name": "Just Enough Items",
            "desc": "Ce mod permet de lister tous les blocs et les objets présent dans le jeu dans l'inventaire.",
            "category": ["lib"],
            "loader": ["fabric", "neoforge", "forge"],
            "img": "https://cdn.modrinth.com/data/u6dRKJwZ/4a3f18ac0d096c9f8e9176984c44be4e58f94c89_96.webp",
            "downloads": 6820000,
            "update": 1729931820,
            "version": ["16", "18", "20"],
            "author": "mezz",
            "source": "https://modrinth.com/mod/jei",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<h2>Just Enough Items</h2>",
                "<hr>",
                "<p>JEI est un mod de visualisation d'objets et de recettes pour Minecraft, conçu dès le départ pour la stabilité et les performances.</p>",
                "<h2>Contrôles</h2>",
                "<hr>",
                "<p><span class=\"fw-bold\">Inventaire :</span></p>",
                "<p>(Options Minecraft -> Contrôles)</p>",
                "<p>Afficher les recettes : Survolez l'objet + R</p>",
                "<p>Afficher les utilisations : Survolez l'objet + U</p>",
                "<p>Basculer la superposition de la liste des objets : Contrôle + O</p>",
                "<p><span class=\"fw-bold\">Liste des objets :</span></p>",
                "<p>Afficher les recettes : Cliquez sur l'objet ou tapez R</p>",
                "<p>Afficher les utilisations : Clic-droit sur l'objet ou tapez U</p>",
                "<p>Page suivante/précédente : Molette de défilement</p>",
                "<p><span class=\"fw-bold\">Recherche :</span></p>",
                "<p>Sélectionner la barre de recherche : Cliquez ou Contrôle + F</p>",
                "<p>Effacer la recherche : Clic-droit</p>",
                "<p>Recherche précédente : Flèche vers le haut</p>",
                "<p>Rechercher par nom de mod : Tapez @ devant un mot (@thaum)</p>",
                "<p>Plusieurs termes fonctionnent ensemble (baguette @thaum)</p>",
                "<p>Exclure des termes de recherche : Tapez - devant un mot (@thaum -baguette)</p>",
                "<p>Rechercher des termes avec des espaces : Mettez les mots entre guillemets (\"deux mots\")</p>",
                "<p><span class=\"fw-bold\">Vue des recettes :</span></p>",
                "<p>Page suivante/précédente : Molette de défilement</p>",
                "<p>Afficher toutes les recettes : Cliquez sur le nom de la catégorie de recette</p>",
                "<p>Déplacer les objets dans la zone de fabrication : Cliquez sur le bouton [+]. Maj+Clic pour déplacer plusieurs ensembles d'objets.</p>",
                "<h2>FAQ</h2>",
                "<hr>",
                "<p>Puis-je inclure JEI dans mon pack de mods ?</p>",
                "<p>Bien sûr !</p>",
                "<p>JEI peut-il fonctionner uniquement côté client ou avec un serveur vanilla ?</p>",
                "<p>Oui, avec certaines fonctionnalités désactivées :</p>",
                "<ul>",
                "<li>Les boutons [+] pour déplacer les objets dans la zone de fabrication.</li>",
                "<li>Cheat d'objets avec beaucoup de données NBT.</li>",
                "<li>Suppression d'objets.</li>",
                "</ul>",
                "<p>Où puis-je trouver la fonctionnalité ___ de NEI ?</p>",
                "<p><a href=https://docs.google.com/spreadsheets/d/1NEWZjKvWB-SibY1BXc1zoYkK7AhjMMBZess9wMy--6w/edit#gid=0>Le tableau ici montre quels mods supportent chaque fonctionnalité.</a></p>",
                "<p>J'ai un problème / bug / crash / rapport / demande, où puis-je l'envoyer ?</p>",
                "<p><a href=https://github.com/mezz/JustEnoughItems/issues>Page GitHub Issues de JEI</a></p>",
                "<h2>Support</h2>",
                "<hr>",
                "<p><a href=https://www.patreon.com/mezz>Devenez un patron sur Patreon</a></p>"
            ]
        },
        {
            "id": "c2me",
            "name": "Concurrent Chunk Management Engine",
            "desc": "Un mod Fabric conçu pour améliorer les performances des chunks dans Minecraft.",
            "category": ["opt"],
            "loader": ["fabric"],
            "img": "https://cdn.modrinth.com/data/VSNURh3q/3c2ce471054466712a44c8758a03e03bb868f93b_96.webp",
            "downloads": 5280000,
            "update": 1733986260,
            "version": ["18", "20", "21"],
            "author": "ishland, duplexsystem",
            "source": "https://modrinth.com/mod/c2me-fabric",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<h2>Concurrent Chunk Management Engine (Fabric)</h2>",
                "<hr>",
                "<p>Un mod Fabric conçu pour améliorer les performances des chunks dans Minecraft.</p>",
                "<a href=https://modrinth.com/mod/c2me-neoforge>Vous cherchez des versions pour NeoForge ?</a>",
                "<h2>Qu'est-ce que C2ME ?</h2>",
                "<hr>",
                "<p>C^2M-Engine, ou C2ME en abrégé, est un mod Fabric conçu pour améliorer les performances de génération, d'E/S et de chargement des chunks. Cela est fait en utilisant plusieurs cœurs CPU en parallèle. Pour de meilleures performances, il est recommandé d'utiliser C2ME avec <a href=https://modrinth.com/mod/lithium>Lithium</a> et <a href=https://modrinth.com/mod/scalablelux>ScalableLux</a>.</p>",
                "<h2>Que signifie C2ME ?</h2>",
                "<hr>",
                "<p>Concurrent Chunk Management Engine, c'est une manière de rendre le jeu mieux optimisé pour les threads et plus évolutif en termes de génération de monde et de performances d'E/S des chunks.</p>",
                "<h2>Parité avec la version vanilla</h2>",
                "<hr>",
                "<p>C2ME ne sacrifie pas la fonctionnalité ou le comportement de la version vanilla, ni ne modifie la génération de monde vanilla au nom de la vitesse brute par défaut. Cependant, en raison de la <a href=https://bugs.mojang.com/browse/MC-55596>non-déterminisme de la génération de monde vanilla</a>, les mondes varieront considérablement d'une exécution à l'autre, même avec la même graine. Ce n'est pas un bug de notre part.</p>",
                "<p>Bien que nous vérifions soigneusement que nous ne modifions aucun comportement vanilla, des bugs sont inévitables. Si vous rencontrez un problème où C2ME s'écarte du comportement vanilla prévu, n'hésitez pas à ouvrir un ticket.</p>",
                "<h2>Compatibilité avec les mods et datapacks</h2>",
                "<hr>",
                "<p>Les datapacks de génération de monde qui peuvent fonctionner sur Minecraft vanilla sont entièrement pris en charge. Les générateurs de monde personnalisés implémentés dans des mods fonctionnent généralement bien, mais peuvent causer des problèmes de compatibilité en raison de certaines hypothèses de conception utilisées par les auteurs de mods pour accélérer la génération de monde.</p>",
                "<p>En tant qu'auteur de mod de génération de monde, si vous trouvez que votre mod est cassé, n'hésitez pas à demander de l'aide sur notre serveur Discord (lien ci-dessous). Nous sommes prêts à aider les auteurs de mods à adopter une génération de monde évolutive.</p>",
                "<p><span class=\"fw-bold\">Sanitisation des comportements indéfinis</span></p>",
                "<p>C2ME inclut CheckedThreadLocalRandom pour le hasard du monde (inclus dans <a href=https://modrinth.com/mod/uwrad>UWRAD</a>) ainsi que quelques autres. Ces détections existent pour empêcher les mods de perturber les composants internes de Minecraft et de causer des problèmes impossibles à déboguer.</p>",
                "<p>Ces détections ne devraient <span class=\"fw-bold\">presque jamais</span> produire de faux positifs et doivent être prises au sérieux et signalées aux auteurs de mods correspondants.</p>",
                "<h2>Avis d'utilisation</h2>",
                "<hr>",
                "<p>Sauvegardez vos mondes et appliquez de bonnes pratiques de modding de jeu.</p>",
                "<h2>Statut de support pour les versions de Minecraft</h2>",
                "<hr>",
                "<p>Seule la dernière version de Minecraft et le dernier snapshot de Minecraft sont entièrement pris en charge. Les anciennes versions de Minecraft sont en support à long terme et recevront des corrections critiques de bugs. Les anciens snapshots de Minecraft ne sont pas pris en charge.</p>",
                "<h2>Support</h2>",
                "<hr>",
                "<p>Notre traqueur de bugs : <a href=https://github.com/RelativityMC/C2ME-fabric/issues>lien</a></p>",
                "<p>Notre serveur Discord : <a href=https://discord.gg/Kdy8NM5HW4>lien</a></p>",
                "<h2>Plus d'informations</h2>",
                "<hr>",
                "<p>Consultez le README.md ici : <a href=https://github.com/RelativityMC/C2ME-fabric>https://github.com/RelativityMC/C2ME-fabric</a></p>"
            ]            
        },
        {
            "id": "supplementaries",
            "name": "Supplementaries",
            "desc": "Supplementaries est un mod hautement configurable axé sur l'ajout de contenu précieux qui comble les lacunes de la version vanilla.",
            "category": ["adv", "equ", "tec"],
            "loader": ["fabric", "forge", "neoforge"],
            "img": "https://cdn.modrinth.com/data/fFEIiSDQ/e9f5f66fa3b67e54acb91258a1428d68311c58bc_96.webp",
            "downloads": 3420000,
            "update": 1733850300,
            "version": ["16", "18", "20"],
            "author": "MehVahdJukaar, Plantkillable",
            "source": "https://modrinth.com/mod/supplementaries",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<h2>📖 À propos 📖</h2>",
                "<hr>",
                "<p>Supplementaries est un mod Forge hautement configurable axé sur l'ajout de contenu précieux qui comble les lacunes de la version vanilla. Ses fonctionnalités sont conçues pour être fonctionnelles, esthétiquement viables et complémentaires au contenu existant, offrant de nombreuses nouvelles façons d'améliorer votre expérience Vanilla+.</p>",
                "<p>Le mod nécessite Moonlight Library.</p>",
                "<p>Bien que prise en charge, la version Fabric peut manquer de certaines fonctionnalités mineures, car le mod est principalement destiné à Forge.</p>",
                "<p>Vous êtes libre d'inclure ce mod dans votre modpack.</p>",
                "<p>Traduit dans les langues suivantes : Deutsch | Polski | Français | Русский | Italiano | English | Čeština | 한국어 | Українська | Português | Српски | Español | Қазақ | Bahasa Melayu | Pirate Speech | 简体中文 (中国) | 繁體中文 (香港) | 繁體中文 (台灣) | Türkçe</p>",
                "<h2>🖼️ Média 🖼️</h2>",
                "<hr>",
                "<p>Découvrez quelques avis ici.</p>",
                "<a href=https://www.youtube.com/watch?v=avG7OTcsJA0>https://www.youtube.com/watch?v=avG7OTcsJA0</a><br>",
                "<a href=https://www.youtube.com/watch?v=vHQSjNacrm4>https://www.youtube.com/watch?v=vHQSjNacrm4</a>",
                "<h2>❓ FAQ ❓</h2>",
                "<hr>",
                "<p><span class=\"fw-bold\">Q : Comment désactiver/modifier une fonctionnalité X ?</span> R : Consultez la section Customization dans le <a href=https://github.com/MehVahdJukaar/Supplementaries/wiki>Wiki</a> ou rejoignez notre <a href=https://modrinth.com/mod/supplementaries>Discord</a>.</p>",
                "<p><span class=\"fw-bold\">Q : Pouvez-vous mettre à jour/rétrograder vers une version X ?</span> R : Je prévois de porter le mod sur chaque nouvelle version majeure de Minecraft, alors soyez patient. Pour les rétrogradations, absolument pas, je ne suis pas intéressé à prendre en charge des versions obsolètes. Maintenir cette version prend déjà beaucoup de mon temps, et les changements entre les versions sont si importants que je devrais presque réapprendre à modder.</p>",
                "<p><span class=\"fw-bold\">Q : Pouvez-vous ajouter une fonctionnalité/bloc X ?</span> R : Je vous encourage à rejoindre notre Discord. Nous avons une section dédiée aux suggestions comme celle-ci. Si je pense que votre idée s'intègre bien, elle a de grandes chances d'être ajoutée.</p>",
                "<p><span class=\"fw-bold\">Q : Comment utiliser un bloc/objet X ?</span> R : Consultez à nouveau le Wiki.</p>",
                "<p><span class=\"fw-bold\">Q : Comment puis-je résoudre ce problème/plantage ?</span> R : Veuillez ouvrir un rapport dans la section Issues, en incluant toujours un rapport de plantage.</p>",
                "<p><span class=\"fw-bold\">Q : La version Fabric manque une fonctionnalité X ?</span> R : Supplementaries est principalement un mod Forge, et si une fonctionnalité manque, cela signifie qu'elle n'a pas eu une implémentation simple ou facile, car Fabric ne disposait pas d'un équivalent d'une fonctionnalité essentielle fournie par l'API Forge. Pour plus d'informations, consultez <a href=https://i.imgur.com/JdipbyU.jpg>ce lien</a>.</p>",
                "<h2>🏆 Crédits 🏆</h2>",
                "<hr>",
                "<p>De nombreuses personnes ont contribué des assets et des textures au mod, et cette liste est trop longue pour être incluse ici. Cependant, pour les voir directement dans le jeu, insérez un Livre écrit nommé \"credits\" dans un tableau d'affichage. De plus, certains sons proviennent de Zapsplat, alors crédit à eux.</p>",
                "<h2>❤️ Soutenez-moi ❤️</h2>",
                "<hr>",
                "<p>Le modding prend beaucoup de mon temps, donc si vous aimez ce que je fais et que vous souhaitez me soutenir, vous pouvez le faire <a href=https://ko-fi.com/mehvahdjukaar>ici</a>. Si vous le faites, vous recevrez un Globe ou une Statue personnalisée rien que pour vous ! Cela s'applique également si vous achetez un serveur auprès d'Akliz en utilisant le code \"supplementaries\".</p>"
            ]
        },
        {
            "id": "open-parties-and-claims",
            "name": "Open Parties and Claims",
            "desc": "Ce mod ajoute la capacité de revendiquer et de forcer le chargement des chunks du monde, ainsi que de créer et gérer des groupes de joueurs.",
            "category": ["lib", "soc"],
            "loader": ["fabric", "forge", "neoforge", "quilt"],
            "img": "https://cdn.modrinth.com/data/gF3BGWvG/410c5443b268912b11709e7d03dd9ec3fda38ea5.png",
            "downloads": 1750000,
            "update": 1733661300,
            "version": ["18", "20", "21"],
            "author": "thexaero",
            "source": "https://modrinth.com/mod/open-parties-and-claims",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<p>Le mod est actuellement en Beta !</p>",
                "<p>Ce mod ajoute la capacité de revendiquer et de forcer le chargement des chunks du monde, ainsi que de créer et gérer des groupes de joueurs. Il offre également aux propriétaires de serveurs des contrôles puissants sur l'utilisation des fonctionnalités du mod par leurs joueurs.</p>",
                "<p>L'API du mod permet à d'autres mods ou plugins d'interagir facilement avec les groupes et les revendications de chunks, à la fois côté serveur et côté client. Le mod est déjà intégré avec les mods <a href=https://modrinth.com/mod/xaeros-minimap>Xaero's Minimap</a> et <a href=https://modrinth.com/mod/xaeros-world-map>World Map</a>. Assurez-vous de les mettre à jour vers leurs dernières versions.</p>",
                "<p>L'API du mod permet également l'implémentation de systèmes d'autorisation de joueurs utilisés par le mod pour certains nœuds d'autorisation (par ex. pour des limites de revendication basées sur les rangs), avec une prise en charge intégrée de Prometheus, FTB Ranks, LuckPerms et les APIs d'autorisation Forge/Fabric. Il permet également l'utilisation de systèmes de groupes personnalisés pour être utilisés par les revendications en plus ou à la place du système de groupe par défaut, avec une prise en charge intégrée d'Argonauts et FTB Teams. Le système de groupe par défaut ou les revendications peuvent être complètement désactivés dans le fichier de configuration principal.</p>",
                "<h2>Commandes :</h2>",
                "<hr>",
                "<p>/openpac ... - commandes de configuration du joueur</p>",
                "<p>/openpac-claims ... - tout ce qui concerne les revendications</p>",
                "<p>/openpac-parties ... - tout ce qui concerne les groupes</p>",
                "<p>/opm - raccourci pour le chat de groupe</p>",
                "<h2>Raccourcis clavier :</h2>",
                "<hr>",
                "<p>' - ouvre l'interface utilisateur du mod. Peut être modifié dans le menu des contrôles.</p>",
                "<h2>Configurations :</h2>",
                "<hr>",
                "<p>[répertoire du monde]/serverconfig/openpartiesandclaims-server.toml - emplacement habituel du fichier de configuration principal. Assurez-vous d'éteindre le serveur avant de le modifier, ou le serveur pourrait écraser toutes vos modifications.</p>",
                "<p>[répertoire du serveur]/config/openpartiesandclaims-server.toml - parfois l'emplacement du fichier de configuration principal sur Fabric/Quilt.</p>",
                "<p>[répertoire du monde]/serverconfig/openpartiesandclaims-... - certaines « configurations de joueurs globales », bien que toutes puissent être accessibles en jeu via l'interface utilisateur.</p>",
                "<h2>FAQ</h2>",
                "<hr>",
                "<p><span class=\"fw-bold\">1) Comment configurer le mod sur mon serveur ?</span> Le mod est principalement configuré via le fichier de configuration principal à [répertoire du monde]/serverconfig/openpartiesandclaims-server.toml, ou parfois à [répertoire du serveur]/config/openpartiesandclaims-server.toml sur Fabric/Quilt, lorsque le serveur n'est pas en cours d'exécution. Les configurations des revendications de serveur, des revendications expirées et des zones sauvages, ainsi que la configuration par défaut du joueur, peuvent être modifiées par les administrateurs en jeu avec l'interface utilisateur (vérifiez vos raccourcis clavier). Les joueurs normaux peuvent configurer leur propre configuration via la même interface. Si le mod n'est pas installé côté client, vous pouvez utiliser les commandes de chat de configuration des joueurs à la place.</p>",
                "<p><span class=\"fw-bold\">2) Comment utiliser ce mod en tant que joueur normal ?</span> La plupart des éléments liés aux revendications peuvent être accessibles via l'interface utilisateur en jeu (vérifiez vos raccourcis clavier). Si vous avez installé le mod Xaero's World Map, vous pouvez également visualiser et modifier vos revendications sur l'écran de la carte en faisant un clic droit sur la carte ou en faisant glisser avec le bouton droit pour faire une sélection. Vous pouvez également utiliser les commandes de chat pour créer/modifier des revendications. Les groupes ne peuvent actuellement être créés et gérés que via les commandes de chat.</p>",
                "<p><span class=\"fw-bold\">3) Pourquoi certaines options sont grisées dans ma configuration de joueur ?</span> L'administrateur/propriétaire du serveur peut configurer avec l'option playerConfigurablePlayerConfigOptions dans le fichier de configuration principal quelles options spécifiques les joueurs peuvent modifier. Tout le reste utilise la valeur de la configuration de joueur par défaut.</p>",
                "<p><span class=\"fw-bold\">4) Comment désactiver toute protection sur mon serveur ?</span> Dans les configurations des revendications de serveur, des revendications expirées et des zones sauvages, ainsi que la configuration de joueur par défaut, désactivez l'option principale de protection. Ensuite, modifiez le fichier de configuration [répertoire du monde]/serverconfig/openpartiesandclaims-server.toml, lorsque le serveur n'est pas en cours d'exécution. Supprimez l'option principale claims.protectClaimedChunks de playerConfigurablePlayerConfigOptions.</p>",
                "<h2>Mods pris en charge :</h2>",
                "<hr>",
                "<p>Beaucoup de mods (généralement plus petits) devraient être automatiquement pris en charge par la protection des chunks revendiqués. Certains mods vont au-delà des mécaniques qu'ils ajoutent ou modifient dans le jeu, auquel cas la protection des chunks n'est pas garantie et doit être ajoutée manuellement, soit à ce mod, soit avec un mod supplémentaire. N'hésitez pas à laisser des suggestions sur le <a href=https://github.com/thexaero/open-parties-and-claims/issues>suivi des problèmes</a> pour les mods que vous souhaitez voir pris en charge. Assurez-vous qu'ils ne le sont pas déjà en le testant et fournissez un exemple de griefing de chunk réalisable avec le mod.</p>",
                "<p>Mods explicitement pris en charge :</p>",
                "<p>(Depuis la version b0.8.0) Create - intégré à la version Forge, mais nécessite une <a href=https://modrinth.com/mod/opac-fabric-create-support>extension</a> lorsqu'il est utilisé sur Fabric/Quilt.</p>"
            ]
        },
        {
            "id": "bartering-station",
            "name": "Bartering Station",
            "desc": "La station de troc ajoute un tout nouveau bloc utilitaire : Placez tous vos lingots d'or, ils seront donnés aux piglins de la zone.",
            "category": ["tec", "mag"],
            "loader": ["fabric", "forge", "neoforge"],
            "img": "https://cdn.modrinth.com/data/EOig9U0j/320cbe8a7409ef0b4928ee174b32b70860eb44a1.png",
            "downloads": 1140000,
            "update": 1733661300,
            "version": ["18", "20", "21"],
            "author": "Fuzs, LunaPixelStudios",
            "source": "https://modrinth.com/mod/bartering-station",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<img src=https://raw.githubusercontent.com/Fuzss/modresources/main/pages/data/barteringstation/strip.png alt=\"Diviseur\" class=\"img-fluid\">",
                "<p>Bartering Station ajoute un tout nouveau bloc utilitaire : Déposez tous vos lingots d'or, ils seront donnés aux piglins dans la zone. Tous les objets qu'ils retournent seront automatiquement collectés dans le bloc de la station. Ajoutez maintenant quelques entonnoirs pour insérer encore plus d'or et extraire vos gains. Le profit n'a jamais été aussi facile !</p>",
                "<img src=https://raw.githubusercontent.com/Fuzss/modresources/main/pages/data/barteringstation/strip.png alt=\"Diviseur\" class=\"img-fluid\">",
                "<p>▶️ La station de troc distribue de l'or à jusqu'à 6 piglins à portée toutes les 15 secondes.</p>",
                "<p>▶️ Pour troquer avec plus de 6 piglins simultanément, configurez simplement d'autres stations de troc !</p>",
                "<p>▶️ Un lingot est pris d'un seul emplacement par cycle, alors répartissez votre or sur tous les emplacements !</p>",
                "<p>▶️ Si votre or n'est pas dépensé, rapprochez les piglins !</p>",
                "<p>▶️ La station collecte tous les résultats du troc et s'arrête de fonctionner lorsque tous ses emplacements sont pleins.</p>",
                "<img src=https://raw.githubusercontent.com/Fuzss/modresources/main/pages/data/barteringstation/strip.png alt=\"Diviseur\" class=\"img-fluid\">",
                "<img src=https://raw.githubusercontent.com/Fuzss/modresources/main/pages/data/barteringstation/media/1.png alt=\"Exemple du bloc\" class=\"max-width-75p\" class=\"img-fluid\">",
                "<img src=https://raw.githubusercontent.com/Fuzss/modresources/main/pages/data/barteringstation/media/2.png alt=\"Menu du bloc\" class=\"max-width-75p\" class=\"img-fluid\">",
                "<img src=https://raw.githubusercontent.com/Fuzss/modresources/main/pages/data/barteringstation/strip.png alt=\"Diviseur\" class=\"img-fluid\">",
                "<p>⏩ <span class=\"fw-bold\">INSTALLATION REQUISE SUR LE CLIENT & REQUISE SUR LE SERVEUR</span></p>",
                "<p>⏩ Nécessite <a href=https://modrinth.com/mod/puzzles-lib>PUZZLES LIB</a> à installer (Forge & Fabric).</p>",
                "<p>⏩ Nécessite <a href=https://modrinth.com/mod/fabric-api>FABRIC API</a> à installer (Fabric).</p>",
                "<p>⏩ Nécessite <a href=https://modrinth.com/mod/forge-config-api-port>FORGE CONFIG API PORT</a> à installer (Fabric).</p>",
                "<img src=https://raw.githubusercontent.com/Fuzss/modresources/main/pages/data/barteringstation/strip.png alt=\"Diviseur\" class=\"img-fluid\">",
                "<p>La configuration est facilement possible directement en jeu à l'aide du menu des mods (nécessite <a href=https://www.curseforge.com/minecraft/mc-mods/modmenu>Mod Menu</a> de <a href=https://www.curseforge.com/members/prospectordev>Prospector</a> à installer sur Fabric) en installant soit <a href=https://www.curseforge.com/minecraft/mc-mods/configured>Configured</a>, soit <a href=https://www.curseforge.com/minecraft/mc-mods/configured-fabric>Configured (Fabric)</a> de <a href=https://www.curseforge.com/members/mrcrayfish>MrCrayfish</a>.</p>",
                "<p>En ce qui concerne la configuration manuelle, tous les fichiers se trouvent dans .minecraft/config, nommés comme MOD_ID-client.toml, MOD_ID-common.toml ou MOD_ID-server.toml selon le type de configuration. Tous les types peuvent ne pas exister pour ce mod, le cas échéant.</p>",
                "<p>Notez que pour les anciennes versions du mod, les fichiers de configuration serveur se trouvent dans .minecraft/saves/WORLD_NAME/serverconfigs, ce qui signifie qu'ils doivent être configurés séparément pour chaque monde individuel.</p>",
                "<img src=https://raw.githubusercontent.com/Fuzss/modresources/main/pages/data/barteringstation/strip.png alt=\"Diviseur\" class=\"img-fluid\">",
                "<p>🌟 Merci à <a href=https://www.curseforge.com/members/vazkii>Vazkii</a> pour le code de l'or flottant, qui est tiré du rendu de la table d'enchantement matricielle dans leur mod <a href=https://www.curseforge.com/minecraft/mc-mods/quark>Quark</a>.</p>",
                "<img src=https://raw.githubusercontent.com/Fuzss/modresources/main/pages/data/barteringstation/strip.png alt=\"Diviseur\" class=\"img-fluid\">"
            ]
            
        },
        {
            "id": "emotecraft",
            "name": "Emotecraft",
            "desc": "Créez vos propre emotes dans Minecraft.",
            "category": ["soc"],
            "loader": ["fabric", "forge", "neoforge", "quilt"],
            "img": "https://cdn.modrinth.com/data/pZ2wrerK/eed7e2c9851392e5879c7d7cb763f142f124e6d2_96.webp",
            "downloads": 991400,
            "update": 1733688060,
            "version": ["16", "18", "20"],
            "author": "KosmzX",
            "source": "https://modrinth.com/plugin/emotecraft",
            "__comment": "La section suivante est pour générer la page du mod. Fait avec du HTML.",
            "desc_html": [
                "<h2>Emotes dans Minecraft JAVA</h2>",
                "<hr>",
                "<span class=\"fw-bold\">Créez vos propres emotes dans Minecraft.</span>",
                "<img src=https://i.imgur.com/tWD40Fg.png alt=\"Un emote dans Minecraft\" class=\"img-fluid\">",
                "<hr>",
                "<h5>Emotes intégrées</h5>",
                "<p>Il existe des emotes par défaut, comme saluer.</p>",
                "<h5>Emotes personnalisées</h5>",
                "<p>Vous pouvez créer vos propres emotes et les jouer.</p>",
                "<h5>Outils de création d'emotes avec Blender et Blockbench</h5>",
                "<p>Plus d'informations <a href=https://kosmx.gitbook.io/emotecraft/tutorial/custom-emotes>ici</a>, ou <a href=https://github.com/KosmX/emotes/tree/development/blender>téléchargez les outils</a>.</p>",
                "<h5>Synchronisation des emotes sur le serveur</h5>",
                "<p>Vous n'avez pas besoin d'envoyer les emotes personnalisées à tout le monde pour les jouer.</p>",
                "<h2>Configuration</h2>",
                "<hr>",
                "<p>Téléchargez le mod et mettez-le dans le dossier mods.</p>",
                "<p>Vous devez installer le mod sur le serveur et le client.</p>",
                "<p>Mais vous n'avez pas besoin d'utiliser le même modloader pour le serveur et le client. Par exemple, Emotecraft avec un client Forge fonctionnera avec un serveur Fabric.</p>",
                "<p>Vous pouvez également utiliser des serveurs Bukkit. Le fichier <code>emotecraft-version-bukkit.jar</code> est le plugin pour Bukkit.</p>",
                "<p>Avec Emotecraft, vous pouvez vous connecter à des serveurs vanilla, mais cela ne fera rien.</p>",
                "<h2>Utilisation</h2>",
                "<hr>",
                "<p>Par défaut, appuyez sur B pour ouvrir la roue de sélection des emotes.</p>",
                "<p>Installez des emotes personnalisées en les plaçant dans le dossier <code>.minecraft/emotes</code>.</p>",
                "<p>(Appuyez simplement sur Ouvrir le dossier des emotes dans l'écran de configuration du mod pour ouvrir le dossier dans votre explorateur de fichiers.) Plus d'informations sur l'utilisation <a href=https://kosmx.gitbook.io/emotecraft/manual/manual>ici</a>.</p>",
                "<a href=https://emotes.kosmx.dev/>Portail de partage des emotes</a>",
                "<p>*Uniquement avec les versions 2.0 et plus récentes d'Emotecraft.</p>"
            ]
        }
    ]
}